In [1]:
import pandas as pd

In [2]:
revenue_q1 = pd.DataFrame(
    {
        "month": ["Jan", "Feb", "Mar"],
        "revenue": [175589, 189645, 163423],
    }
)
revenue_q1

  month  revenue
0   Jan   175589
1   Feb   189645
2   Mar   163423

In [3]:
revenue_q2 = pd.DataFrame(
    {
        "month": ["Apr", "May", "Jun"],
        "revenue": [14567, 15863, 17999],
    }
)
revenue_q2

  month  revenue
0   Apr    14567
1   May    15863
2   Jun    17999

In [4]:
pd.concat([revenue_q1, revenue_q2])

  month  revenue
0   Jan   175589
1   Feb   189645
2   Mar   163423
0   Apr    14567
1   May    15863
2   Jun    17999

In [5]:
populations = pd.DataFrame(
    {
        "Country": ["China", "India", "Pakistan"],
        "Population": [1444216107, 1393409038, 220892331],
    }
)

populations

    Country  Population
0     China  1444216107
1     India  1393409038
2  Pakistan   220892331

In [6]:
gdps = pd.DataFrame(
    {
        "Country": ["China", "India", "United States", "Indonesia", "Pakistan"],
        "GDP": [14342903, 2875142, 21433226, 1058393, 263687],
    }
)
gdps

         Country       GDP
0          China  14342903
1          India   2875142
2  United States  21433226
3      Indonesia   1058393
4       Pakistan    263687

In [7]:
pd.merge(populations, gdps, on="Country")

    Country  Population       GDP
0     China  1444216107  14342903
1     India  1393409038   2875142
2  Pakistan   220892331    263687

In [8]:
pd.merge(populations, gdps, on="Country", how="outer")

         Country    Population       GDP
0          China  1.444216e+09  14342903
1          India  1.393409e+09   2875142
2      Indonesia           NaN   1058393
3       Pakistan  2.208923e+08    263687
4  United States           NaN  21433226